*** Vertico
Minimal completion UI.
#+BEGIN_SRC emacs-lisp
  (use-package vertico
    :ensure t
    :bind (:map vertico-map
  	      ("C-j" . vertico-next)
  	      ("C-k" . vertico-previous)
  	      ("C-f" . vertico-exit)
  	      :map minibuffer-local-map
  	      ("M-h" . backward-kill-word))
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))

  (use-package savehist
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :ensure t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    (marginalia-max-relative-
     (marginalia-align 'right)
     :init
     (marginalia-mode)))
    
#+END_SRC

Center the vertico frame in the middle of Emacs.
#+BEGIN_SRC emacs-lisp
  (use-package vertico-posframe
    :ensure t
    :init
    (vertico-posframe-mode))

  (setq vertico-posframe-parameters
      '((left-fringe . 24)
        (right-fringe . 24)))
#+END_SRC

#+RESULTS:
: ((left-fringe . 24) (right-fringe . 24))

